Configuration/Documents/бит_ум_ОтчетностьПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_ОтчетностьПоИР</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
				<xr:Item>Document.Увольнение</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ум_ВыполненныеДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполняемыеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_ДополнительныеПараметрыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_ДополнительныеПараметрыПечати</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначениеПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/бит_ум_ОтчетностьПоИР/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства	
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	СоздатьДополнительныеКомандыПечати();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		УстановитьФункциональныеОпцииФормы();
		ЗаполнитьОтветственногоПоИностраннымРаботникам();
		
		Если ЗначениеЗаполнено(Параметры.Основание) Тогда
			Для Каждого СтрокаТаблицы Из Объект.ВыполняемыеДействия Цикл
				ОбновитьПараметры(СтрокаТаблицы.Действие, СтрокаТаблицы.КлючСвязи);
			КонецЦикла;
		КонецЕсли;
		
		Если Параметры.Свойство("Событие") Тогда
			Объект.Событие = Параметры.Событие;
		КонецЕсли;
		
		Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		
		Если Параметры.Свойство("ВыполняемыеДействия") И ТипЗнч(Параметры.ВыполняемыеДействия) = Тип("Массив") Тогда
			Для Каждого Действие Из Параметры.ВыполняемыеДействия Цикл
				СтрокаТабличнойЧасти = Объект.ВыполняемыеДействия.Добавить();
				СтрокаТабличнойЧасти.КлючСвязи = ПоискПоТабличнойЧасти();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Действие);
				ОбновитьПараметры(СтрокаТабличнойЧасти.Действие, СтрокаТабличнойЧасти.КлючСвязи);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			ОрганизацияПриИзмененииНаСервере();
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
	ПодготовитьФормуНаСервере();
	УстановитьФункциональныеОпцииФормы();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды		
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	

	ПодготовитьФормуНаСервере();
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПослеЗаписиНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбраноЗначениеПараметраДляЗаполнения" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Параметр") И ЗначениеЗаполнено(Параметр.Параметр) Тогда
			Для Каждого СтрокаТаблицы Из Объект.ДополнительныеПараметрыПечати Цикл
				Если СтрокаТаблицы.Параметр = Параметр.Параметр Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Параметр, "Значение, ЗначениеЗначениеПолей, ЗначениеЗначение"); 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыполняемыеДействия

&НаКлиенте
Процедура ВыполняемыеДействияПриАктивизацииСтроки(Элемент)

	ОтобразитьПараметрыПечати();
	ЗапомнитьТекущуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполняемыеДействияПередУдалением(Элемент, Отказ)

	КлючПоиска = Новый Структура("КлючСвязи", Элементы.ДополнительныеПараметрыПечати.ОтборСтрок.КлючСвязи);
	
	НайденныеСтроки = Объект.ДополнительныеПараметрыПечати.НайтиСтроки(КлючПоиска);
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		Объект.ДополнительныеПараметрыПечати.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполняемыеДействияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		ДействиеПредыдущий = Неопределено;
	Иначе
		ДействиеПредыдущий = Элементы.ВыполняемыеДействия.ТекущиеДанные.Действие;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		
		Кандидат = ПоискПоТабличнойЧасти();
		
		Элементы.ВыполняемыеДействия.ТекущиеДанные.КлючСвязи = Кандидат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполняемыеДействияПослеУдаления(Элемент)
	
	ОтобразитьПараметрыПечати();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполняемыеДействияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущиеДанные = Элементы.ВыполняемыеДействия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДействиеПредыдущий <> ТекущиеДанные.Действие Тогда
		ОбновитьПараметры(ТекущиеДанные.Действие, ТекущиеДанные.КлючСвязи);
	КонецЕсли;
	
	ОтобразитьПараметрыПечати();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеПараметрыПечати

&НаКлиенте
Процедура ДополнительныеПараметрыПечатиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.ПолеАдреса Тогда
		Элементы.ДополнительныеПараметрыПечатиЗначение.КнопкаВыбора = Истина;
		Элементы.ДополнительныеПараметрыПечатиЗначение.РедактированиеТекста = Ложь;
	ИначеЕсли Элемент.ТекущиеДанные.ЭтоДлиннаяСтрока Тогда
		Элементы.ДополнительныеПараметрыПечатиЗначение.КнопкаВыбора = Истина;
		Элементы.ДополнительныеПараметрыПечатиЗначение.РедактированиеТекста = Истина;
	Иначе	
		Элементы.ДополнительныеПараметрыПечатиЗначение.КнопкаВыбора = Неопределено;
		Элементы.ДополнительныеПараметрыПечатиЗначение.РедактированиеТекста = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыПечатиЗначениеОчистка(Элемент, СтандартнаяОбработка)

	Элементы.ДополнительныеПараметрыПечати.ТекущиеДанные.ЗначениеЗначениеПолей = ""; 
	Элементы.ДополнительныеПараметрыПечати.ТекущиеДанные.ЗначениеЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыПечатиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеПараметрыПечати.ТекущиеДанные;

	Если ТекущиеДанные.ПолеАдреса Тогда
		
  		ВидКонтактнойИнформацииАдреса = Новый Структура;
    	ВидКонтактнойИнформацииАдреса.Вставить("Тип",
			ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	    ВидКонтактнойИнформацииАдреса.Вставить("ТолькоНациональныйАдрес", Истина);
	    ВидКонтактнойИнформацииАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
    	ВидКонтактнойИнформацииАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);		
		
		ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
			ВидКонтактнойИнформацииАдреса,
			?(ЗначениеЗаполнено(ТекущиеДанные.ЗначениеЗначение), ТекущиеДанные.ЗначениеЗначение, ТекущиеДанные.ЗначениеЗначениеПолей),
			ТекущиеДанные.Значение);
		ПараметрыОткрытия.Заголовок = Строка(ТекущиеДанные.Параметр);
				
		УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Элемент);		
		
	ИначеЕсли ТекущиеДанные.ЭтоДлиннаяСтрока Тогда
		
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", Элементы.ДополнительныеПараметрыПечати.ТекущаяСтрока);
		Оповещение = Новый ОписаниеОповещения("ЗначениеНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ТекущиеДанные.Значение, 
			Строка(ТекущиеДанные.Параметр));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПараметрыПечатиЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеПараметрыПечати.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.ПолеАдреса Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Значение = ВыбранноеЗначение.Представление;
	ТекущиеДанные.ЗначениеЗначениеПолей = ВыбранноеЗначение.КонтактнаяИнформация;
	ТекущиеДанные.ЗначениеЗначение = ВыбранноеЗначение.Значение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВыполняемыеДействия.Количество() > 0 Тогда
		
		Если Объект.Проведен Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличная часть будет очищена. Заполнить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		КонецЕсли;

		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДействиямиПоСобытиюЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ЗаполнитьДействиямиПоСобытию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениеПараметра(Команда)
	
	СписокПараметров = Новый Массив;
	
	УникальныеЗначения = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из Объект.ДополнительныеПараметрыПечати Цикл
		Если УникальныеЗначения[СтрокаТаблицы.Параметр] = Неопределено Тогда
			СписокПараметров.Добавить(СтрокаТаблицы.Параметр);
			УникальныеЗначения.Вставить(СтрокаТаблицы.Параметр, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокПараметров.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет параметров для заполнения.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокПараметров", СписокПараметров);

	ОткрытьФорму("Документ.бит_ум_ОтчетностьПоИР.Форма.ВводЗначенияПараметра", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПризнакВыполнено(Команда)
	
	ТекстПодсказки = НСтр("ru = 'Укажите дату выполнения'");
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыВыполнения", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ТекущаяДата(), ТекстПодсказки, ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоВыбраннойСтроке(Команда)
	
	Если Элементы.ВыполняемыеДействия.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПечатьПоВыбраннойСтроке", Элементы.ВыполняемыеДействия.ТекущиеДанные.НомерСтроки);
	
	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Данные еще не записаны.
					|Выполнение действия ""%1"" возможно только после записи данных.
					|Данные будут записаны.'"),
				НСтр("ru = 'Печать по выбранной строке'"));
				
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьКомандуПечатиПодтверждениеЗаписи", ЭтаФорма, ДополнительныеПараметры);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
		ВыполнитьКомандуПечатиПодтверждениеЗаписи(КодВозвратаДиалога.ОК, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ВыполнитьКомандуПечатиПодтверждениеЗаписи(Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	  
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ЗарплатаКадрыПодсистемы.ПодписиДокументов
&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент)
	
	ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент)
	
	ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры
// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Функция СостояниеДокумента(Объект)
	
	РучнаяКорректировка = Неопределено;
	
	Если Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли Объект.Проведен Тогда
		СостояниеДокумента = 1;
	Иначе
		СостояниеДокумента = 0;
	КонецЕсли;
	
	Возврат СостояниеДокумента;
	
КонецФункции

&НаСервере
Функция ПоискПоТабличнойЧасти()
	
	НеУстановлено = Истина;
	Кандидат = Объект.ВыполняемыеДействия.Количество();

	Пока НеУстановлено Цикл
			
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КлючСвязи", Кандидат);
			
		Если НЕ ЗначениеЗаполнено(Объект.ВыполняемыеДействия.НайтиСтроки(ПараметрыОтбора)) Тогда
			
			НеУстановлено = Ложь;

			Возврат Кандидат
			
		Иначе
			
			// Такое значение ключа уже использовано
			Кандидат = Кандидат + 1;

		КонецЕсли;

	КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ОтобразитьПараметрыПечати()
	
	СтрокаТаблицы = Элементы.ВыполняемыеДействия.ТекущиеДанные;
	
	Если СтрокаТаблицы <> Неопределено Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТаблицы.КлючСвязи); 
		Элементы.ДополнительныеПараметрыПечати.ОтборСтрок = ОтборСтрок;
	Иначе
		Если Объект.ВыполняемыеДействия.Количество() = 0 Тогда
			Объект.ДополнительныеПараметрыПечати.Очистить();
		КонецЕсли;
		ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", -1); 
		Элементы.ДополнительныеПараметрыПечати.ОтборСтрок = ОтборСтрок;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	ЗаполнитьОтветственногоПоИностраннымРаботникам();
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, Объект.Дата);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоПоИностраннымРаботникам()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Оформил = бит_ум_УчетМигрантовСервер.ПолучитьОтветственноеЛицо(Объект.Организация, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметры(Действие, КлючСвязи)
	
	СписокДоступныхПараметров = Новый Массив;
	
	Если ЗначениеЗаполнено(Действие) Тогда
		ВидОформляемогоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действие, "ВидОформляемогоДокумента");
	КонецЕсли;                                                                           
	
	Если ЗначениеЗаполнено(ВидОформляемогоДокумента) Тогда
		СписокДоступныхПараметров = бит_ум_УчетМигрантовПовтИсп.ПолучитьСписокПараметровПечати(ВидОформляемогоДокумента);
	КонецЕсли;
	
	НайденныеСтроки = Объект.ДополнительныеПараметрыПечати.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	// Добавим отсутствующие параметры
	Для Каждого Параметр Из СписокДоступныхПараметров Цикл
		
		ПараметрНайден = Ложь;
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если Строка.Параметр = Параметр Тогда
				ПараметрНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ПараметрНайден Тогда
			СтрокаТаблицы = Объект.ДополнительныеПараметрыПечати.Добавить();
			СтрокаТаблицы.КлючСвязи = КлючСвязи;
			СтрокаТаблицы.Параметр = Параметр;
			СтрокаТаблицы.Значение = СтрокаТаблицы.Параметр.ТипЗначения.ПривестиЗначение(Неопределено);
			ЗаполнитьДобавленныеКолонкиВСтрокеПараметров(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверим, что нет лишних параметров
	Для Каждого Строка Из НайденныеСтроки Цикл
		Если СписокДоступныхПараметров.Найти(Строка.Параметр) = Неопределено Тогда
			Объект.ДополнительныеПараметрыПечати.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Объект.ДополнительныеПараметрыПечати.Сортировать("КлючСвязи, РеквизитДопУпорядочивания, Параметр");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()
	
	Для Каждого СтрокаТаблицы Из Объект.ДополнительныеПараметрыПечати Цикл
		ЗаполнитьДобавленныеКолонкиВСтрокеПараметров(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиВСтрокеПараметров(СтрокаТаблицы)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.Параметр,
		"ТипЗначения, ПолеАдреса, РеквизитДопУпорядочивания");
	
	Если ЗначенияРеквизитов.ТипЗначения.Типы().Количество() = 1
		И ЗначенияРеквизитов.ТипЗначения.Типы()[0] = Тип("Строка")
		И ЗначенияРеквизитов.ТипЗначения.КвалификаторыСтроки.Длина > 10 Тогда
		СтрокаТаблицы.ЭтоДлиннаяСтрока = Истина;
	Иначе
		СтрокаТаблицы.ЭтоДлиннаяСтрока = Ложь;
	КонецЕсли;
	СтрокаТаблицы.ПолеАдреса = ЗначенияРеквизитов.ПолеАдреса;
	СтрокаТаблицы.РеквизитДопУпорядочивания = ЗначенияРеквизитов.РеквизитДопУпорядочивания;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораЗавершение(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.ДополнительныеПараметрыПечати.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	ТекущиеДанные.Значение = ВведенныйТекст;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьТекущуюСтроку()
	
	Если Элементы.ВыполняемыеДействия.ТекущиеДанные = Неопределено Тогда
		ТекущаяСтрока = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Новый Структура("НомерСтроки, Сотрудник, Действие");
	КонецЕсли;
	
	Для Каждого Поле Из ТекущаяСтрока Цикл
		ТекущаяСтрока[Поле.Ключ] = Элементы.ВыполняемыеДействия.ТекущиеДанные[Поле.Ключ]; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДополнительныеКомандыПечати()
	
	Если Элементы.Найти("ПодменюПечать") <> Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ФормаКоманднаяПанельПодменюПечатьПечатьПоВыбраннойСтроке", Тип("КнопкаФормы"), Элементы.ПодменюПечать);
	Иначе
		НовыйЭлемент = Элементы.Добавить("ФормаКоманднаяПанельПодменюПечатьПечатьПоВыбраннойСтроке", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанельПодменюПечать);
	КонецЕсли;
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = "ПечатьПоВыбраннойСтроке";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействиямиПоСобытию()
	
	ДлительнаяОперация = НачатьЗаполнениеТаблицыВыполняемыеДействия();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения =
		НСтр("ru = 'Заполнение документа ""Отчетность по иностранным работникам""'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьДействиямиПоСобытиюЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействиямиПоСобытиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"),
			ОбщегоНазначенияКлиент.ДатаСеанса(), Результат.ПодробноеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	ОтобразитьПараметрыПечати();
	ЗапомнитьТекущуюСтроку();
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеТаблицыВыполняемыеДействия()
	
	ПараметрыПроцедуры = Новый Структура("Организация, Дата, Событие, Проведен");
	ЗаполнитьЗначенияСвойств(ПараметрыПроцедуры, Объект);
	
	Если ПараметрыПроцедуры.Проведен Тогда 
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
	Объект.ВыполняемыеДействия.Очистить();
	Объект.ДополнительныеПараметрыПечати.Очистить();
	
	ТаблицаВыполняемыеДействия = Объект.ВыполняемыеДействия.Выгрузить();
	ТаблицаВыполняемыеДействия.Очистить();
	
	ПараметрыПроцедуры.Вставить("ТаблицаВыполняемыеДействия", ТаблицаВыполняемыеДействия);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение документа ""Отчетность по иностранным работникам""'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.бит_ум_ОтчетностьПоИР.ПодготовитьДанныеДляЗаполнения", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(АдресРезультата)

	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;                           

	Если СтруктураДанных.Свойство("ТаблицаВыполняемыеДействия") Тогда
		
		Объект.ВыполняемыеДействия.Загрузить(СтруктураДанных.ТаблицаВыполняемыеДействия);
		
		КлючСвязи = 0;
		
		Для Каждого СтрокаТаблицы Из Объект.ВыполняемыеДействия Цикл
			
			КлючСвязи = КлючСвязи + 1;
			
			СтрокаТаблицы.КлючСвязи = КлючСвязи;
			
			ОбновитьПараметры(СтрокаТаблицы.Действие, КлючСвязи);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДействиямиПоСобытиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДействиямиПоСобытию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПечатиПодтверждениеЗаписи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ОчиститьСообщения();
		ЭтаФорма.Записать();
		Если Объект.Ссылка.Пустая() Или ЭтаФорма.Модифицированность Тогда
			Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
		КонецЕсли;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Документ.бит_ум_ОтчетностьПоИР",
		"ПечатьФормОтчетности", Объект.Ссылка,
		ЭтаФорма, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыВыполнения(Дата, Параметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.ВыполняемыеДействия Цикл
		Если НЕ СтрокаТЧ.Выполнено Тогда
			СтрокаТЧ.Выполнено = Истина;
			СтрокаТЧ.ДатаВыполнения = Дата;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
